[{"title": "NASA's Mars 2020 Will Hunt for Microscopic Fossils", "preview": "A new paper identifies a ring of minerals at the rover's landing site that are ideal for fossilizing microbial life."}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA InSight's 'Mole' Is Out of Sight", "preview": "Now that the heat probe is just below the Martian surface, InSight's arm will scoop some additional soil on top to help it keep digging so it can take Mars' temperature."}, {"title": "NASA to Broadcast Mars 2020 Perseverance Launch, Prelaunch Activities", "preview": "Starting July 27, news activities will cover everything from mission engineering and science to returning samples from Mars to, of course, the launch itself."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday."}, {"title": "Mars 2020 Unwrapped and Ready for More Testing", "preview": "In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing."}, {"title": "NASA Administrator Statement on Moon to Mars Initiative, FY 2021 Budget", "preview": "Jim Bridenstine addresses NASA's ambitious plans for the coming years, including Mars Sample Return."}, {"title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}, {"title": "Common Questions about InSight's 'Mole'", "preview": "The following Q&As with members of the team answer some of the most common questions about the burrowing device, part of a science instrument called the Heat Flow and Physical Properties Package (HP3)."}, {"title": "8 Martian Postcards to Celebrate Curiosity's Landing Anniversary", "preview": "The NASA rover touched down eight years ago, on Aug. 5, 2012, and will soon be joined by a second rover, Perseverance."}, {"title": "NASA's Mars Rover Drivers Need Your Help", "preview": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover."}, {"title": "Q&A with the Student Who Named Ingenuity, NASA's Mars Helicopter", "preview": "As a longtime fan of space exploration, Vaneeza Rupani appreciates the creativity and collaboration involved with trying to fly on another planet."}, {"title": "Space History Is Made in This NASA Robot Factory", "preview": "From rockets to rovers, JPL's Spacecraft Assembly Facility has been at the center of robotic spaceflight. Here's a closer look at what makes it so special."}, {"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover."}, {"title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}]