[{"title": "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes", "preview": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition."}, {"title": "Mars Helicopter Attached to NASA's Perseverance Rover", "preview": "The team also fueled the rover's sky crane to get ready for this summer's history-making launch."}, {"title": "Scientists Explore Outback as Testbed for Mars", "preview": "Australia provides a great place for NASA's Mars 2020 and the ESA-Roscosmos ExoMars scientists to hone techniques in preparation for searching for signs ancient life on Mars."}, {"title": "How NASA's Mars Helicopter Will Reach the Red Planet's Surface", "preview": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity."}, {"title": "NASA's Briefcase-Size MarCO Satellite Picks Up Honors", "preview": "The twin spacecraft, the first of their kind to fly into deep space, earn a Laureate from Aviation Week & Space Technology."}, {"title": "MAVEN Maps Electric Currents around Mars that are Fundamental to Atmospheric Loss", "preview": "Five years after NASA’s MAVEN spacecraft entered into orbit around Mars, data from the mission has led to the creation of a map of electric current systems in the Martian atmosphere."}, {"title": "NASA's Mars 2020 Heads Into the Test Chamber", "preview": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions."}, {"title": "NASA's Perseverance Rover Mission Getting in Shape for Launch", "preview": "Stacking spacecraft components on top of each other is one of the final assembly steps before a mission launches to the Red Planet."}, {"title": "NASA's Mars 2020 Rover Completes Its First Drive", "preview": "In a 10-plus-hour marathon, the rover steered, turned and drove in 3-foot (1-meter) increments over small ramps."}, {"title": "NASA's Perseverance Rover Will Look at Mars Through These 'Eyes'", "preview": "A pair of zoomable cameras will help scientists and rover drivers with high-resolution color images."}, {"title": "The MarCO Mission Comes to an End", "preview": "The pair of briefcase-sized satellites made history when they sailed past Mars in 2019."}, {"title": "NASA's Mars 2020 Rover Closer to Getting Its Name", "preview": "155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July."}, {"title": "NASA's Perseverance Rover Attached to Atlas V Rocket", "preview": "Ready for its launch later in the month, the Mars-bound rover will touch terra firma no more."}, {"title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars", "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}]