[{"title": "NASA Wins Two Emmy Awards for Interactive Mission Coverage", "preview": "NASA-JPL's coverage of the Mars InSight landing earns one of the two wins, making this the NASA center's second Emmy."}, {"title": "5 Hidden Gems Are Riding Aboard NASA's Perseverance Rover", "preview": "The symbols, mottos, and small objects added to the agency's newest Mars rover serve a variety of purposes, from functional to decorative."}, {"title": "NASA to Reveal Name of Its Next Mars Rover", "preview": "After a months-long contest among students to name NASA's newest Mars rover, the agency will reveal the winning name — and the winning student — this Thursday."}, {"title": "NASA's New Mars Rover Will Use X-Rays to Hunt Fossils", "preview": "PIXL, an instrument on the end of the Perseverance rover's arm, will search for chemical fingerprints left by ancient microbes."}, {"title": "10.9 Million Names Now Aboard NASA's Perseverance Mars Rover", "preview": "As part of NASA's 'Send Your Name to Mars' campaign, they've been stenciled onto three microchips along with essays from NASA's 'Name the Rover' contest. Next stop: Mars."}, {"title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch", "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."}, {"title": "Sensors on Mars 2020 Spacecraft Answer Long-Distance Call From Earth", "preview": "Instruments tailored to collect data during the descent of NASA's next rover through the Red Planet's atmosphere have been checked in flight."}, {"title": "NASA's Perseverance Rover Goes Through Trials by Fire, Ice, Light and Sound", "preview": "The agency's new Mars rover is put through a series of tests in vacuum chambers, acoustic chambers and more to get ready for the Red Planet."}, {"title": "Newfound Martian Aurora Actually the Most Common; Sheds Light on Mars' Changing Climate", "preview": "A type of Martian aurora first identified by NASA’s MAVEN spacecraft in 2016 is actually the most common form of aurora occurring on the Red Planet, according to new results from the mission."}, {"title": "Mars 2020 Unwrapped and Ready for More Testing", "preview": "In time-lapse video, bunny-suited engineers remove the inner layer of protective foil on NASA's Mars 2020 rover after it was relocated for testing."}, {"title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth", "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA's Ingenuity Mars Helicopter Recharges Its Batteries in Flight", "preview": "Headed to the Red Planet with the Perseverance rover, the pioneering helicopter is powered up for the first time in interplanetary space as part of a systems check."}, {"title": "3 Things We've Learned From NASA's Mars InSight", "preview": "Scientists are finding new mysteries since the geophysics mission landed two years ago."}, {"title": "NASA Readies Perseverance Mars Rover's Earthly Twin", "preview": "Did you know NASA's next Mars rover has a nearly identical sibling on Earth for testing? Even better, it's about to roll for the first time through a replica Martian landscape."}]